# ============================================================================
# Brewfile — Full system inventory for Mac migration
# Run: brew bundle --file=Brewfile
# ============================================================================

# --- Core Development Tools -------------------------------------------------
brew "git"
brew "gh"
brew "bat"
brew "eza"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"
brew "htop"
brew "btop"
brew "tmux"
brew "stow"
brew "starship"
brew "zoxide"
brew "python@3.12"
brew "node"
brew "uv"

# --- LLM Tools --------------------------------------------------------------
brew "ollama"

# --- Additional CLI Tools (discovered via audit) ----------------------------
brew "mas"              # Mac App Store CLI
brew "deno"             # JS/TS runtime
brew "ffmpeg"           # Media processing
brew "lazygit"          # Terminal Git UI
brew "ncdu"             # Disk usage analyzer
brew "pandoc"           # Document converter
brew "yt-dlp"           # Video downloader
brew "gallery-dl"       # Media archival
brew "gnupg"            # GPG encryption
brew "pipx"             # Isolated Python tool installer
brew "speedtest-cli"    # Network speed test
brew "jupyterlab"       # Data science notebooks
brew "duck"             # Cyberduck CLI
brew "gifsicle"         # GIF optimizer
brew "gifski"           # High-quality GIF encoder
brew "pngquant"         # PNG compressor
brew "portaudio"        # Audio I/O library
brew "python@3.11"      # Python 3.11 (compatibility)

# --- Casks (GUI Applications) -----------------------------------------------
cask "ghostty"
cask "cursor"
cask "visual-studio-code"
cask "docker"
cask "raycast"
cask "arc"
cask "1password"
cask "obsidian"
cask "notion"
cask "slack"
cask "discord"

# Additional casks (discovered via audit)
cask "spotify"
cask "vlc"
cask "stats"                # System monitor in menu bar
cask "localcan"             # Local development
cask "supacode"             # AI code editor
cask "mactex"               # LaTeX distribution
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "qlvideo"              # QuickLook video preview
cask "inkscape"             # Vector graphics
cask "codexbar"             # Menu bar customization
cask "gcollazo-mongodb"     # MongoDB Compass

# Apps available as casks but currently manually installed
cask "brave-browser"
cask "windsurf"
cask "helium-browser"
cask "iina"                 # Modern media player
cask "coconutbattery"       # Battery health monitor
cask "chatgpt"
cask "claude"
cask "notion-calendar"
cask "google-drive"
cask "mountain-duck"        # Cloud storage mounting
cask "rectangle"            # Window management
cask "imageoptim"           # Image compression
cask "zotero"               # Research reference manager
cask "transmission"         # Torrent client
cask "tabby"                # Terminal emulator
cask "monitorcontrol"       # External display brightness

# --- Mac App Store Apps (via mas) -------------------------------------------
# Install with: mas install <id>
# Requires: App Store sign-in on target Mac

mas "WhatsApp", id: 310633997
mas "Notability", id: 360593530
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Blackmagic Disk Speed Test", id: 425264550
mas "The Unarchiver", id: 425424353
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "CopyClip", id: 595191960
mas "Parcel Classic", id: 639968404
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "Capo", id: 696977615
mas "Microsoft OneNote", id: 784801555
mas "OneDrive", id: 823766827
mas "TestFlight", id: 899247664
mas "NordVPN", id: 905953485
mas "Amphetamine", id: 937984704
mas "Telegram Lite", id: 946399090
mas "Microsoft Outlook", id: 985367838
mas "Image2Icon", id: 992115977
mas "AdBlock Pro", id: 1018301773
mas "Shapr3D", id: 1091675654
mas "Exporter", id: 1099120373
mas "Infuse", id: 1136220934
mas "Speedtest", id: 1153157709
mas "Microsoft To Do", id: 1274495053
mas "ColorSlurp", id: 1287239339
mas "Bitwarden", id: 1352778147
mas "Flighty", id: 1358823008
mas "Solves", id: 1394359548
mas "Photomator", id: 1444636541
mas "Mini Motorways", id: 1456188526
mas "HP", id: 1474276998
mas "Messenger", id: 1480068668
mas "Boop", id: 1518425043
mas "Perplexity", id: 6714467650
