anysphere.cursorpyright
aramok.aramoks-black
asilverio.blackai-visual-studio-code
batisteo.vscode-django
benjaminbenais.copilot-theme
christian-kohler.npm-intellisense
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dotjoshjohnson.xml
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.codespaces
github.copilot
github.copilot-chat
github.remotehub
github.vscode-pull-request-github
golang.go
hsnazar.hyper-term-theme
humy2833.ftp-simple
james-yu.latex-workshop
kevinrose.vsc-python-indent
magicstack.magicpython
mathematic.vscode-latex
mgesbert.python-path
mrmlnc.vscode-apache
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
nickfode.latex-formatter
nimda.deepdark-material
njpwerner.autodocstring
pflannery.vscode-versionlens
pkief.material-icon-theme
rebornix.ruby
redhat.java
reditorsupport.r
reditorsupport.r-syntax
ritwickdey.liveserver
shyykoserhiy.vscode-spotify
tarik02.absolutely-black
tblnk.material-oled
tecosaur.latex-utilities
torn4dom4n.latex-support
tushortz.python-extended-snippets
twxs.cmake
ujjwalbarman.kamekazi-dark
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
vscodevim.vim
wholroyd.jinja
wingrunr21.vscode-ruby
xabikos.javascriptsnippets
zhuangtongfa.material-theme
zignd.html-css-class-completion
